[
  {
    "projectName": "ASEE Web Application (Product for FRO - fellowship research opportunity)",
    "role": "Frontend React Js Developer",
    "shortDescription": "🧑🏻‍💻The project was about developing a product as a service which is divided in 2 parts- Admin and public application for client, which can cater to activities related to help its FRO department and or other small business organizations efficiently manage and administer federal funds for higher education through its various grants and contracts.",
    "overviewDescription": "Web Application developed, to help its Fellowship and Research Opportunities (FRO) department and or other small business organizations efficiently manage and administer federal funds for higher education and research opportunities applications, through its various grants and contracts. Making client the Best Participant experience whenever and wherever it is required. Using this application client administers their internship and fellowship programs. This project provides services to connect to the participants, communicate with them, and guide them through the application process, resolving queries, if any. It provides platform infrastructure to execute the application, review, selection, and award distribution processes. It has services to conduct grant disbursement and payments to several stakeholders involved in the process and also provided and administrative support. The entire process of these functions is conducted through a set of web applications -Admin and Public facing application which can cater to activities related to help its FRO department and or other small business organizations efficiently manage and administer federal funds for higher education through its various grants and contracts.",
    "tools": [
      "React Js",
      "TypeScript",
      "JavaScript",
      "Redux",
      "Next JS",
      "Material UI",
      "SCSS/SASS",
      "many other libraries"
    ],
    "image": "asee"
  },
  {
    "projectName": "Connect Well Web Application (self project)",
    "role": "MERN Developer",
    "shortDescription": "(Hackathon Project) 🧑🏻‍💻 A dynamic web application which can be used at organization level to improve employee's connectivity within organization. It provides one step platform to get connected with unkown experts for any help in specific technical domains. Covers everything needed to resolve issue.",
    "overviewDescription": "This web application can be integrated into company's portal which solves the issue like unable to get quick help related to client or company work to incure confidentiality and limited reach to known people on specific technology. It provides a platform to ask queries providing seperated room chat space for every user and high chances for getting solution due to more employees as expert. Support for all technology stacks ike docker, react, java, etc. It increases employee connectivity within organization who are located world-wide. Since Experts are employees as well this reduces information leak. Application triggers notification mails to desired people for evry action to alert them and get quick resolutions. To imporove expert employee's engagement application provides feature for expert leader board. Few other user support options are present like turn on/off notification, treanding tech stack, adding tech stack, expert verification through manager, etc. This project can be a great application integrated in company's portal for help of technical engineer employees.",
    "tools": [
      "React Js",
      "JavaScript",
      "TypeScript",
      "Node JS",
      "Express JS",
      "Mongo DB",
      "CSS",
      "few other libraries"
    ],
    "image": "connectwell",
    "liveLink": "https://connectwell-2022.web.app"
  }
]
